## TRANSFORM DATA
1. APPLY()
2. MAP()
3. ASSIGN()
4. REPLACE(OLD,NEW)

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("raw_data.csv")
df2=df.copy()

# without using any function
# pass a lambda function into thw apply( lambda) function
# apply() is a high order function and lambda is a lower order function

df2["tax"]=df2["income"].apply(lambda x : "20%" if x >= 60000 else "10%")

# Replace the gender values with...male=>M,Female=>F ,Unknown=>U
gender_map={"Male" :"M" , "Female" : "F", "Unknown":"U"}

df2["gender"]=df2["gender"].map(gender_map)
df2

# assign function chamge the collumn values
df2=df2.assign(new_income=df2["income"]*1.1)
df2

# replace function replce the value with another values
df2["country"]=df2["country"].replace("USA","US")
df2

# rename the all columns at ones
df2.columns=["Id","Name","Age","Country","Gender","Income","Tax","New_Income"]
df2

# rename one column value
df2.rename(columns={"New_Income":"Salary"})

df.rename(index={0:"First",1:"Second",2:"Third",3:"Four",4:"Five",5:"Six",6:"Seven",7:"Eight",8:"Nine",9:"Ten",10:"Eleven"})
# df2.raw=["First","Second","Third","Four","Five","Six","Seven","Eight","Nine","Ten","Eleven"]

# shorting
df2.sort_values("Income") #ascending order sorting
df2=df2.sort_values("Income",ascending=False) #decending order sorting

# df2=df2.fillna(50)
# df2=df2.sort_values(["Income","Age"])

df2.sort_index()

# reset the idx value
df2.reset_index()  #old index bi print krega
df2=df2.reset_index(drop=True) #old indx column ko delt kr dega

#rank method
df2["Ranking"]=df2["Income"].rank(ascending=False)
# how to resolve tie values
df2["Ranking"]=df2["Income"].rank(ascending=False,method="dense")
df2["Ranking"]=df2["Income"].rank(ascending=False,method="min")
df2["Ranking"]=df2["Income"].rank(ascending=False,method="max")

In [15]:
df2

    Id          Name   Age Country Gender   Income  Tax  Ranking
0    6           NaN  45.0   India      F  73000.0  20%      1.0
1    7    Ahmed Khan  38.0     NaN      M  68000.0  20%      2.0
2    8    Rachel Lee  29.0      US      F  62000.0  20%      4.0
3    2    Jane Smith   NaN  Canada      F  62000.0  20%      4.0
4   10   Emily Davis  31.0      US    NaN  58000.0  10%      5.0
5    1      John Doe  29.0      US      M  55000.0  10%      7.0
6    1      John Doe  29.0      US      M  55000.0  10%      7.0
7    5        Li Wei  27.0   China      M  51000.0  10%      8.0
8    3          Alex   NaN      US      U  47000.0  10%      9.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     10.0
10   4  Maria Garcia  34.0   Spain      F      NaN  10%      NaN